{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from serka.fetchers import EIDCFetcher\n",
    "from serka.graph.extractors import (\n",
    "\tAuthorExtractor,\n",
    "\tDatasetExtractor,\n",
    "\tOrganisationExtractor,\n",
    "\tRelationshipExtractor,\n",
    "\tTextExtractor,\n",
    ")\n",
    "from haystack import Pipeline\n",
    "from haystack.components.preprocessors import DocumentSplitter\n",
    "from haystack.components.writers import DocumentWriter\n",
    "from haystack_integrations.components.embedders.ollama import OllamaDocumentEmbedder\n",
    "from neo4j_haystack import Neo4jDocumentStore\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()\n",
    "NEO4J_USERNAME = os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2025-04-25 11:26:06,446 - haystack.core.pipeline.base - INFO - Warming up component splitter...\n",
      "2025-04-25 11:26:06,447 - haystack.core.pipeline.pipeline - INFO - Running component fetcher\n",
      "2025-04-25 11:26:06,670 - haystack.core.pipeline.pipeline - INFO - Running component author_extractor\n",
      "2025-04-25 11:26:06,675 - haystack.core.pipeline.pipeline - INFO - Running component orgs_extractor\n",
      "2025-04-25 11:26:06,681 - haystack.core.pipeline.pipeline - INFO - Running component dataset_extractor\n",
      "2025-04-25 11:26:06,687 - haystack.core.pipeline.pipeline - INFO - Running component rel_extractor\n",
      "2025-04-25 11:26:06,693 - haystack.core.pipeline.pipeline - INFO - Running component text_extractor\n",
      "2025-04-25 11:26:06,696 - haystack.core.pipeline.pipeline - INFO - Running component joiner\n",
      "2025-04-25 11:26:06,698 - haystack.core.pipeline.pipeline - INFO - Running component splitter\n",
      "2025-04-25 11:26:06,714 - haystack.core.pipeline.pipeline - INFO - Running component node_emb\n",
      "Calculating embeddings:   0%|          | 0/7 [00:00<?, ?it/s]2025-04-25 11:26:06,908 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  14%|█▍        | 1/7 [00:00<00:01,  5.08it/s]2025-04-25 11:26:07,082 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  29%|██▊       | 2/7 [00:00<00:00,  5.45it/s]2025-04-25 11:26:07,249 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  43%|████▎     | 3/7 [00:00<00:00,  5.68it/s]2025-04-25 11:26:07,415 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  57%|█████▋    | 4/7 [00:00<00:00,  5.81it/s]2025-04-25 11:26:07,583 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  71%|███████▏  | 5/7 [00:00<00:00,  5.86it/s]2025-04-25 11:26:07,752 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  86%|████████▌ | 6/7 [00:01<00:00,  5.88it/s]2025-04-25 11:26:07,875 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings: 100%|██████████| 7/7 [00:01<00:00,  6.01it/s]\n",
      "Calculating embeddings:   0%|          | 0/2 [00:00<?, ?it/s]2025-04-25 11:26:08,042 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  50%|█████     | 1/2 [00:00<00:00,  6.03it/s]2025-04-25 11:26:08,172 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings: 100%|██████████| 2/2 [00:00<00:00,  6.77it/s]\n",
      "Calculating embeddings:   0%|          | 0/4 [00:00<?, ?it/s]2025-04-25 11:26:08,351 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  25%|██▌       | 1/4 [00:00<00:00,  5.61it/s]2025-04-25 11:26:08,525 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  50%|█████     | 2/4 [00:00<00:00,  5.69it/s]2025-04-25 11:26:08,703 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  75%|███████▌  | 3/4 [00:00<00:00,  5.66it/s]2025-04-25 11:26:08,739 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings: 100%|██████████| 4/4 [00:00<00:00,  7.11it/s]\n",
      "2025-04-25 11:26:08,746 - haystack.core.pipeline.pipeline - INFO - Running component doc_emb\n",
      "Calculating embeddings:   0%|          | 0/10 [00:00<?, ?it/s]2025-04-25 11:26:08,922 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  10%|█         | 1/10 [00:00<00:01,  5.57it/s]2025-04-25 11:26:09,103 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  20%|██        | 2/10 [00:00<00:01,  5.54it/s]2025-04-25 11:26:09,282 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  30%|███       | 3/10 [00:00<00:01,  5.56it/s]2025-04-25 11:26:09,464 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  40%|████      | 4/10 [00:00<00:01,  5.53it/s]2025-04-25 11:26:09,659 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  50%|█████     | 5/10 [00:00<00:00,  5.38it/s]2025-04-25 11:26:09,843 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  60%|██████    | 6/10 [00:01<00:00,  5.40it/s]2025-04-25 11:26:10,031 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  70%|███████   | 7/10 [00:01<00:00,  5.38it/s]2025-04-25 11:26:10,218 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  80%|████████  | 8/10 [00:01<00:00,  5.36it/s]2025-04-25 11:26:10,410 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings:  90%|█████████ | 9/10 [00:01<00:00,  5.31it/s]2025-04-25 11:26:10,517 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings: 100%|██████████| 10/10 [00:01<00:00,  5.64it/s]\n",
      "2025-04-25 11:26:10,649 - haystack.core.pipeline.pipeline - INFO - Running component graph_writer\n",
      "2025-04-25 11:26:11,889 - neo4j.notifications - INFO - Received notification from DBMS server: {severity: INFORMATION} {code: Neo.ClientNotification.Statement.CartesianProduct} {category: PERFORMANCE} {title: This query builds a cartesian product between disconnected patterns.} {description: If a part of a query contains multiple disconnected patterns, this will build a cartesian product between all those parts. This may produce a large amount of data and slow down query processing. While occasionally intended, it may often be possible to reformulate the query that avoids the use of this cross product, perhaps by adding a relationship between the different parts or by using OPTIONAL MATCH (identifier is: (b))} {position: line: 1, column: 31, offset: 30} for query: 'UNWIND $relations as relation MATCH (a), (b) WHERE a.uri = relation[0] AND b.uri = relation[1] MERGE (a)-[:AUTHORED_BY]->(b) RETURN COUNT(*)'\n",
      "2025-04-25 11:26:11,954 - neo4j.notifications - INFO - Received notification from DBMS server: {severity: INFORMATION} {code: Neo.ClientNotification.Statement.CartesianProduct} {category: PERFORMANCE} {title: This query builds a cartesian product between disconnected patterns.} {description: If a part of a query contains multiple disconnected patterns, this will build a cartesian product between all those parts. This may produce a large amount of data and slow down query processing. While occasionally intended, it may often be possible to reformulate the query that avoids the use of this cross product, perhaps by adding a relationship between the different parts or by using OPTIONAL MATCH (identifier is: (b))} {position: line: 1, column: 31, offset: 30} for query: 'UNWIND $relations as relation MATCH (a), (b) WHERE a.uri = relation[0] AND b.uri = relation[1] MERGE (a)-[:AFFILIATED_WITH]->(b) RETURN COUNT(*)'\n",
      "2025-04-25 11:26:12,075 - neo4j.notifications - INFO - Received notification from DBMS server: {severity: INFORMATION} {code: Neo.ClientNotification.Statement.CartesianProduct} {category: PERFORMANCE} {title: This query builds a cartesian product between disconnected patterns.} {description: If a part of a query contains multiple disconnected patterns, this will build a cartesian product between all those parts. This may produce a large amount of data and slow down query processing. While occasionally intended, it may often be possible to reformulate the query that avoids the use of this cross product, perhaps by adding a relationship between the different parts or by using OPTIONAL MATCH (identifier is: (b))} {position: line: 1, column: 31, offset: 30} for query: 'UNWIND $relations as relation MATCH (a), (b) WHERE a.uri = relation[0] AND b.uri = relation[1] MERGE (a)-[:CONTRIBUTED_TO]->(b) RETURN COUNT(*)'\n",
      "2025-04-25 11:26:12,209 - neo4j.notifications - INFO - Received notification from DBMS server: {severity: INFORMATION} {code: Neo.ClientNotification.Statement.CartesianProduct} {category: PERFORMANCE} {title: This query builds a cartesian product between disconnected patterns.} {description: If a part of a query contains multiple disconnected patterns, this will build a cartesian product between all those parts. This may produce a large amount of data and slow down query processing. While occasionally intended, it may often be possible to reformulate the query that avoids the use of this cross product, perhaps by adding a relationship between the different parts or by using OPTIONAL MATCH (identifier is: (b))} {position: line: 1, column: 31, offset: 30} for query: 'UNWIND $relations as relation MATCH (a:TextChunk), (b) WHERE a.doc_id = relation[0] AND b.uri = relation[1] MERGE (a)-[:DESCRIPTION_OF]->(b) RETURN COUNT(*)'\n",
      "2025-04-25 11:26:12,289 - neo4j.notifications - INFO - Received notification from DBMS server: {severity: INFORMATION} {code: Neo.ClientNotification.Statement.CartesianProduct} {category: PERFORMANCE} {title: This query builds a cartesian product between disconnected patterns.} {description: If a part of a query contains multiple disconnected patterns, this will build a cartesian product between all those parts. This may produce a large amount of data and slow down query processing. While occasionally intended, it may often be possible to reformulate the query that avoids the use of this cross product, perhaps by adding a relationship between the different parts or by using OPTIONAL MATCH (identifier is: (b))} {position: line: 1, column: 31, offset: 30} for query: 'UNWIND $relations as relation MATCH (a:TextChunk), (b) WHERE a.doc_id = relation[0] AND b.uri = relation[1] MERGE (a)-[:LINEAGE_OF]->(b) RETURN COUNT(*)'\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'doc_emb': {'meta': {'model': 'nomic-embed-text'}},\n",
       " 'graph_writer': {'nodes_created': {'Person': 215,\n",
       "   'Organisation': 57,\n",
       "   'Dataset': 100,\n",
       "   'Document': 305},\n",
       "  'relations_created': {'AUTHORED_BY': 318,\n",
       "   'AFFILIATED_WITH': 182,\n",
       "   'CONTRIBUTED_TO': 410,\n",
       "   'DESCRIPTION_OF': 139,\n",
       "   'LINEAGE_OF': 166}}}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from serka.graph.embedders import OllamaNodeEmbedder\n",
    "from serka.graph.joiners import NodeJoiner\n",
    "from serka.graph.writers import Neo4jGraphWriter\n",
    "\n",
    "p = Pipeline()\n",
    "p.add_component(\"fetcher\", EIDCFetcher())\n",
    "p.add_component(\"author_extractor\", AuthorExtractor())\n",
    "p.add_component(\"orgs_extractor\", OrganisationExtractor())\n",
    "p.add_component(\"dataset_extractor\", DatasetExtractor())\n",
    "p.add_component(\"text_extractor\", TextExtractor([\"description\", \"lineage\"]))\n",
    "p.add_component(\n",
    "\t\"splitter\", DocumentSplitter(split_by=\"word\", split_length=150, split_overlap=50)\n",
    ")\n",
    "p.add_component(\"doc_emb\", OllamaDocumentEmbedder())\n",
    "p.add_component(\"joiner\", NodeJoiner())\n",
    "p.add_component(\"rel_extractor\", RelationshipExtractor())\n",
    "p.add_component(\"node_emb\", OllamaNodeEmbedder())\n",
    "p.add_component(\n",
    "\t\"graph_writer\", Neo4jGraphWriter(username=NEO4J_USERNAME, password=NEO4J_PASSWORD)\n",
    ")\n",
    "\n",
    "p.connect(\"fetcher\", \"author_extractor\")\n",
    "p.connect(\"fetcher\", \"orgs_extractor\")\n",
    "p.connect(\"fetcher\", \"dataset_extractor\")\n",
    "p.connect(\"fetcher\", \"rel_extractor\")\n",
    "p.connect(\"fetcher\", \"text_extractor\")\n",
    "\n",
    "p.connect(\"author_extractor\", \"joiner.authors\")\n",
    "p.connect(\"orgs_extractor\", \"joiner.orgs\")\n",
    "p.connect(\"dataset_extractor\", \"joiner.datasets\")\n",
    "\n",
    "p.connect(\"text_extractor\", \"splitter\")\n",
    "p.connect(\"splitter\", \"doc_emb\")\n",
    "p.connect(\"doc_emb\", \"graph_writer.docs\")\n",
    "\n",
    "p.connect(\"joiner\", \"node_emb\")\n",
    "p.connect(\"node_emb\", \"graph_writer.nodes\")\n",
    "p.connect(\"rel_extractor\", \"graph_writer.relations\")\n",
    "\n",
    "p.run(data={\"fetcher\": {\"rows\": 1}})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'records': [{'publicationDate': '2022-08-02T00:00:00.000+00:00',\n",
       "   'authorAffiliation': ['UK Centre for Ecology & Hydrology'],\n",
       "   'authorGivenName': ['C.', 'C.S.', 'A.W.', 'R.D.'],\n",
       "   'authorFamilyName': ['Marston', 'Rowland', \"O'Neil\", 'Morton'],\n",
       "   'authorFullName': ['Marston, C.',\n",
       "    'Rowland, C.S.',\n",
       "    \"O'Neil, A.W.\",\n",
       "    'Morton, R.D.'],\n",
       "   'authorOrcid': ['https://orcid.org/0000-0002-2070-2187',\n",
       "    'https://orcid.org/0000-0002-0459-506X',\n",
       "    'https://orcid.org/0000-0003-3591-1034',\n",
       "    'https://orcid.org/0000-0003-3947-6463'],\n",
       "   'authorRor': ['https://ror.org/00pggkr55'],\n",
       "   'catalogue': 'eidc',\n",
       "   'description': 'This is a 10m pixel data set representing the land surface of Northern Ireland, classified into 21 UKCEH land cover classes, based upon Biodiversity Action Plan broad habitats. It is a two-band raster in GeoTiff format. The first band gives the most likely land cover type; the second band gives the per-parcel probability of the land cover. A full description of this and all UKCEH LCM2021 products are available from the LCM2021 product documentation.',\n",
       "   'documentType': 'GEMINI_DOCUMENT',\n",
       "   'funder': ['Natural Environment Research Council'],\n",
       "   'grant': ['NE/R016429/1'],\n",
       "   'identifier': 'e44ae9bd-fa32-4aab-9524-fbb11d34a20a',\n",
       "   'incomingCitationCount': 0,\n",
       "   'givenName': ['C.', 'C.S.', 'A.W.', 'R.D.'],\n",
       "   'familyName': ['Marston', 'Rowland', \"O'Neil\", 'Morton'],\n",
       "   'fullName': ['Marston, C.',\n",
       "    'Rowland, C.S.',\n",
       "    \"O'Neil, A.W.\",\n",
       "    'Morton, R.D.'],\n",
       "   'keyword': ['Northern Ireland',\n",
       "    'Land cover',\n",
       "    'Mapping',\n",
       "    'Biodiversity Action Plan',\n",
       "    'habitat',\n",
       "    'mapping',\n",
       "    'land cover'],\n",
       "   'keywordsPlace': ['Northern Ireland'],\n",
       "   'keywordsTheme': ['Land cover', 'Mapping'],\n",
       "   'keywordsOther': ['Biodiversity Action Plan',\n",
       "    'habitat',\n",
       "    'mapping',\n",
       "    'land cover'],\n",
       "   'licence': 'Non-Open government licence',\n",
       "   'lineage': \"UKCEH's automated land cover algorithms classify 10 m pixels across the whole of UK. Training data were automatically selected from stable land covers over the interval of 2018 to 2020. A Random Forest classifier used these to classify four composite images representing per season median surface reflectance. Seasonal images were integrated with context layers (e.g., height, aspect, slope, coastal proximity, urban proximity and so forth) to reduce confusion among classes with similar spectra.\\n\\nLand cover was validated by organising the 10 m pixel classification into a land parcel framework (the LCM2021 classified land parcels product). The classified land parcels were compared to known land cover producing a confusion matrix to determine overall and per class accuracy. Details are available from the product documentation accompanying this dataset.\\n\\nThe 25 m rasterised land parcels product is created by pixelating the corresponding land parcel product.\",\n",
       "   'locations': ['POLYGON((-8.178 54.022, -8.178 55.313, -5.432 55.313, -5.432 54.022, -8.178 54.022))'],\n",
       "   'orcid': ['https://orcid.org/0000-0002-2070-2187',\n",
       "    'https://orcid.org/0000-0002-0459-506X',\n",
       "    'https://orcid.org/0000-0003-3591-1034',\n",
       "    'https://orcid.org/0000-0003-3947-6463'],\n",
       "   'organisation': ['UK Centre for Ecology & Hydrology',\n",
       "    'NERC EDS Environmental Information Data Centre'],\n",
       "   'recordType': 'Dataset',\n",
       "   'resourceIdentifier': ['https://catalogue.ceh.ac.uk/id/e44ae9bd-fa32-4aab-9524-fbb11d34a20a',\n",
       "    '10.5285/e44ae9bd-fa32-4aab-9524-fbb11d34a20a'],\n",
       "   'resourceStatus': 'Controlled',\n",
       "   'resourceType': 'Dataset',\n",
       "   'rightsHolder': ['UK Centre for Ecology & Hydrology'],\n",
       "   'ror': ['https://ror.org/00pggkr55', 'https://ror.org/04xw4m193'],\n",
       "   'state': 'published',\n",
       "   'title': 'Land Cover Map 2021 (10m classified pixels, N. Ireland)',\n",
       "   'topic': ['0/Land cover/', '0/Mapping/'],\n",
       "   'version': 1.0,\n",
       "   'view': ['public', 'tinzha'],\n",
       "   'shortenedDescription': 'This is a 10m pixel data set representing the land surface of Northern Ireland, classified into 21 UKCEH land cover classes, based upon Biodiversity Action Plan broad habitats. It is a two-band raster in GeoTiff format. The first band gives the most likely land cover...'}]}"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "EIDCFetcher().run(rows=10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2025-04-24 10:08:20,802 - neo4j.notifications - WARNING - Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated procedure. ('db.index.vector.createNodeIndex' has been replaced by 'CREATE VECTOR INDEX')} {position: line: 2, column: 17, offset: 17} for query: '\\n                CALL db.index.vector.createNodeIndex(\\n                    $index_name,\\n                    $label,\\n                    $property_key,\\n                    toInteger($vector_dimension),\\n                    $similarity_function\\n                )\\n                '\n",
      "2025-04-24 10:08:20,849 - haystack.core.pipeline.base - INFO - Warming up component splitter...\n",
      "2025-04-24 10:08:20,850 - haystack.core.pipeline.pipeline - INFO - Running component fetcher\n",
      "2025-04-24 10:08:20,958 - haystack.core.pipeline.pipeline - INFO - Running component author_extractor\n",
      "2025-04-24 10:08:20,958 - haystack.core.pipeline.pipeline - INFO - Running component dataset_extractor\n",
      "2025-04-24 10:08:20,959 - haystack.core.pipeline.pipeline - INFO - Running component org_extractor\n",
      "2025-04-24 10:08:20,959 - haystack.core.pipeline.pipeline - INFO - Running component rel_extractor\n",
      "2025-04-24 10:08:20,960 - haystack.core.pipeline.pipeline - INFO - Running component text_extractor\n",
      "2025-04-24 10:08:20,960 - haystack.core.pipeline.pipeline - INFO - Running component splitter\n",
      "2025-04-24 10:08:20,961 - haystack.core.pipeline.pipeline - INFO - Running component embedder\n",
      "Calculating embeddings:   0%|          | 0/1 [00:00<?, ?it/s]2025-04-24 10:08:21,004 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings: 100%|██████████| 1/1 [00:00<00:00, 23.16it/s]\n",
      "2025-04-24 10:08:21,006 - haystack.core.pipeline.pipeline - INFO - Running component writer\n",
      "2025-04-24 10:08:21,006 - neo4j_haystack.document_stores.neo4j_store - WARNING - At the moment nested (complex) objects are not allowed as `list` values in Document object. Property `_split_overlap` will be skipped and not stored in Neo4j node\n",
      "2025-04-24 10:08:21,006 - neo4j_haystack.document_stores.neo4j_store - WARNING - At the moment nested (complex) objects are not allowed as `list` values in Document object. Property `_split_overlap` will be skipped and not stored in Neo4j node\n",
      "2025-04-24 10:08:21,168 - neo4j.notifications - WARNING - Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (doc, row) { ... }} {position: line: 7, column: 17, offset: 227} for query: \"\\n                WITH $records AS batch\\n                UNWIND batch as row\\n                MERGE (doc:`TextChunk` {id: row.id})\\n                SET doc += row{.*, embedding: null}\\n                WITH doc, row\\n                CALL { WITH doc, row\\n                    MATCH(doc:`TextChunk` {id: row.id}) WHERE row.embedding IS NOT NULL\\n                    CALL db.create.setNodeVectorProperty(doc, 'embedding', row.embedding)\\n                }\\n                \"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'author_extractor': {'authors': [{'forename': 'C.',\n",
       "    'surname': 'Marston',\n",
       "    'uri': 'https://orcid.org/0000-0002-2070-2187'},\n",
       "   {'forename': 'C.S.',\n",
       "    'surname': 'Rowland',\n",
       "    'uri': 'https://orcid.org/0000-0002-0459-506X'},\n",
       "   {'forename': 'A.W.',\n",
       "    'surname': \"O'Neil\",\n",
       "    'uri': 'https://orcid.org/0000-0003-3591-1034'},\n",
       "   {'forename': 'R.D.',\n",
       "    'surname': 'Morton',\n",
       "    'uri': 'https://orcid.org/0000-0003-3947-6463'}]},\n",
       " 'dataset_extractor': {'datasets': [{'uri': 'https://doi.org/10.5285/e44ae9bd-fa32-4aab-9524-fbb11d34a20a',\n",
       "    'title': 'Land Cover Map 2021 (10m classified pixels, N. Ireland)'}]},\n",
       " 'org_extractor': {'organisations': [{'name': 'UK Centre for Ecology & Hydrology',\n",
       "    'uri': 'https://ror.org/00pggkr55'},\n",
       "   {'name': 'NERC EDS Environmental Information Data Centre',\n",
       "    'uri': 'https://ror.org/04xw4m193'}]},\n",
       " 'rel_extractor': {'relationships': {'AUTHORED_BY': [('https://doi.org/10.5285/e44ae9bd-fa32-4aab-9524-fbb11d34a20a',\n",
       "     'https://orcid.org/0000-0002-2070-2187'),\n",
       "    ('https://doi.org/10.5285/e44ae9bd-fa32-4aab-9524-fbb11d34a20a',\n",
       "     'https://orcid.org/0000-0002-0459-506X'),\n",
       "    ('https://doi.org/10.5285/e44ae9bd-fa32-4aab-9524-fbb11d34a20a',\n",
       "     'https://orcid.org/0000-0003-3591-1034'),\n",
       "    ('https://doi.org/10.5285/e44ae9bd-fa32-4aab-9524-fbb11d34a20a',\n",
       "     'https://orcid.org/0000-0003-3947-6463')],\n",
       "   'AFFILIATED_WITH': [('https://orcid.org/0000-0002-2070-2187',\n",
       "     'https://ror.org/00pggkr55')]}},\n",
       " 'embedder': {'meta': {'model': 'nomic-embed-text'}},\n",
       " 'writer': {'documents_written': 2}}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "doc_store = Neo4jDocumentStore(\n",
    "\turl=\"bolt://localhost:7687\",\n",
    "\tusername=NEO4J_USERNAME,\n",
    "\tpassword=NEO4J_PASSWORD,\n",
    "\tindex=\"text-chunk-embeddings\",\n",
    "\tembedding_field=\"embedding\",\n",
    "\tdatabase=\"neo4j\",\n",
    "\tembedding_dim=768,\n",
    "\tnode_label=\"TextChunk\",\n",
    ")\n",
    "\n",
    "p = Pipeline()\n",
    "p.add_component(\"fetcher\", EIDCFetcher())\n",
    "p.add_component(\"author_extractor\", AuthorExtractor())\n",
    "p.add_component(\"dataset_extractor\", DatasetExtractor())\n",
    "p.add_component(\"org_extractor\", OrganisationExtractor())\n",
    "p.add_component(\"rel_extractor\", RelationshipExtractor())\n",
    "p.add_component(\"text_extractor\", TextExtractor([\"description\"]))\n",
    "p.add_component(\n",
    "\t\"splitter\", DocumentSplitter(split_by=\"word\", split_length=50, split_overlap=20)\n",
    ")\n",
    "p.add_component(\n",
    "\t\"embedder\",\n",
    "\tOllamaDocumentEmbedder(model=\"nomic-embed-text\", url=\"http://localhost:11434\"),\n",
    ")\n",
    "p.add_component(\"writer\", DocumentWriter(doc_store))\n",
    "\n",
    "p.connect(\"fetcher\", \"author_extractor\")\n",
    "p.connect(\"fetcher\", \"dataset_extractor\")\n",
    "p.connect(\"fetcher\", \"org_extractor\")\n",
    "p.connect(\"fetcher\", \"rel_extractor\")\n",
    "p.connect(\"fetcher\", \"text_extractor\")\n",
    "p.connect(\"text_extractor\", \"splitter\")\n",
    "p.connect(\"splitter\", \"embedder\")\n",
    "p.connect(\"embedder\", \"writer\")\n",
    "\n",
    "p.run(data={\"fetcher\": {\"rows\": 1}})"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
