{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from serka.fetchers import EIDCFetcher\n",
    "from serka.graph.extractors import (\n",
    "\tAuthorExtractor,\n",
    "\tDatasetExtractor,\n",
    "\tOrganisationExtractor,\n",
    "\tRelationshipExtractor,\n",
    "\tTextExtractor,\n",
    ")\n",
    "from haystack import Pipeline\n",
    "from haystack.components.preprocessors import DocumentSplitter\n",
    "from haystack_integrations.components.embedders.ollama import OllamaDocumentEmbedder\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()\n",
    "NEO4J_USERNAME = os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2025-04-28 15:42:20,344 - haystack.core.pipeline.base - INFO - Warming up component splitter...\n",
      "2025-04-28 15:42:20,345 - haystack.core.pipeline.pipeline - INFO - Running component fetcher\n",
      "2025-04-28 15:42:20,481 - haystack.core.pipeline.pipeline - INFO - Running component author_extractor\n",
      "2025-04-28 15:42:20,482 - haystack.core.pipeline.pipeline - INFO - Running component orgs_extractor\n",
      "2025-04-28 15:42:20,483 - haystack.core.pipeline.pipeline - INFO - Running component dataset_extractor\n",
      "2025-04-28 15:42:20,484 - haystack.core.pipeline.pipeline - INFO - Running component rel_extractor\n",
      "2025-04-28 15:42:20,485 - haystack.core.pipeline.pipeline - INFO - Running component text_extractor\n",
      "2025-04-28 15:42:20,485 - haystack.core.pipeline.pipeline - INFO - Running component joiner\n",
      "2025-04-28 15:42:20,486 - haystack.core.pipeline.pipeline - INFO - Running component splitter\n",
      "2025-04-28 15:42:20,487 - haystack.core.pipeline.pipeline - INFO - Running component node_emb\n",
      "Calculating embeddings:   0%|          | 0/1 [00:00<?, ?it/s]2025-04-28 15:42:21,622 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings: 100%|██████████| 1/1 [00:01<00:00,  1.13s/it]\n",
      "Calculating embeddings:   0%|          | 0/1 [00:00<?, ?it/s]2025-04-28 15:42:21,648 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings: 100%|██████████| 1/1 [00:00<00:00, 47.14it/s]\n",
      "Calculating embeddings:   0%|          | 0/1 [00:00<?, ?it/s]2025-04-28 15:42:21,714 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings: 100%|██████████| 1/1 [00:00<00:00, 15.11it/s]\n",
      "2025-04-28 15:42:21,717 - haystack.core.pipeline.pipeline - INFO - Running component doc_emb\n",
      "Calculating embeddings:   0%|          | 0/1 [00:00<?, ?it/s]2025-04-28 15:42:21,883 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embed \"HTTP/1.1 200 OK\"\n",
      "Calculating embeddings: 100%|██████████| 1/1 [00:00<00:00,  5.89it/s]\n",
      "2025-04-28 15:42:21,899 - haystack.core.pipeline.pipeline - INFO - Running component graph_writer\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2025-04-28 15:42:22,665 - neo4j.notifications - INFO - Received notification from DBMS server: {severity: INFORMATION} {code: Neo.ClientNotification.Statement.CartesianProduct} {category: PERFORMANCE} {title: This query builds a cartesian product between disconnected patterns.} {description: If a part of a query contains multiple disconnected patterns, this will build a cartesian product between all those parts. This may produce a large amount of data and slow down query processing. While occasionally intended, it may often be possible to reformulate the query that avoids the use of this cross product, perhaps by adding a relationship between the different parts or by using OPTIONAL MATCH (identifier is: (b))} {position: line: 1, column: 31, offset: 30} for query: 'UNWIND $relations as relation MATCH (a), (b) WHERE a.uri = relation[0] AND b.uri = relation[1] MERGE (a)-[:AUTHORED_BY]->(b) RETURN COUNT(*)'\n",
      "2025-04-28 15:42:22,723 - neo4j.notifications - INFO - Received notification from DBMS server: {severity: INFORMATION} {code: Neo.ClientNotification.Statement.CartesianProduct} {category: PERFORMANCE} {title: This query builds a cartesian product between disconnected patterns.} {description: If a part of a query contains multiple disconnected patterns, this will build a cartesian product between all those parts. This may produce a large amount of data and slow down query processing. While occasionally intended, it may often be possible to reformulate the query that avoids the use of this cross product, perhaps by adding a relationship between the different parts or by using OPTIONAL MATCH (identifier is: (b))} {position: line: 1, column: 31, offset: 30} for query: 'UNWIND $relations as relation MATCH (a), (b) WHERE a.uri = relation[0] AND b.uri = relation[1] MERGE (a)-[:AFFILIATED_WITH]->(b) RETURN COUNT(*)'\n",
      "2025-04-28 15:42:22,784 - neo4j.notifications - INFO - Received notification from DBMS server: {severity: INFORMATION} {code: Neo.ClientNotification.Statement.CartesianProduct} {category: PERFORMANCE} {title: This query builds a cartesian product between disconnected patterns.} {description: If a part of a query contains multiple disconnected patterns, this will build a cartesian product between all those parts. This may produce a large amount of data and slow down query processing. While occasionally intended, it may often be possible to reformulate the query that avoids the use of this cross product, perhaps by adding a relationship between the different parts or by using OPTIONAL MATCH (identifier is: (b))} {position: line: 1, column: 31, offset: 30} for query: 'UNWIND $relations as relation MATCH (a), (b) WHERE a.uri = relation[0] AND b.uri = relation[1] MERGE (a)-[:CONTRIBUTED_TO]->(b) RETURN COUNT(*)'\n",
      "2025-04-28 15:42:23,000 - neo4j.notifications - INFO - Received notification from DBMS server: {severity: INFORMATION} {code: Neo.ClientNotification.Statement.CartesianProduct} {category: PERFORMANCE} {title: This query builds a cartesian product between disconnected patterns.} {description: If a part of a query contains multiple disconnected patterns, this will build a cartesian product between all those parts. This may produce a large amount of data and slow down query processing. While occasionally intended, it may often be possible to reformulate the query that avoids the use of this cross product, perhaps by adding a relationship between the different parts or by using OPTIONAL MATCH (identifier is: (b))} {position: line: 1, column: 31, offset: 30} for query: 'UNWIND $relations as relation MATCH (a:TextChunk), (b) WHERE a.doc_id = relation[0] AND b.uri = relation[1] MERGE (a)-[:DESCRIPTION_OF]->(b) RETURN COUNT(*)'\n",
      "2025-04-28 15:42:23,071 - neo4j.notifications - INFO - Received notification from DBMS server: {severity: INFORMATION} {code: Neo.ClientNotification.Statement.CartesianProduct} {category: PERFORMANCE} {title: This query builds a cartesian product between disconnected patterns.} {description: If a part of a query contains multiple disconnected patterns, this will build a cartesian product between all those parts. This may produce a large amount of data and slow down query processing. While occasionally intended, it may often be possible to reformulate the query that avoids the use of this cross product, perhaps by adding a relationship between the different parts or by using OPTIONAL MATCH (identifier is: (b))} {position: line: 1, column: 31, offset: 30} for query: 'UNWIND $relations as relation MATCH (a:TextChunk), (b) WHERE a.doc_id = relation[0] AND b.uri = relation[1] MERGE (a)-[:LINEAGE_OF]->(b) RETURN COUNT(*)'\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'doc_emb': {'meta': {'model': 'nomic-embed-text'}},\n",
       " 'graph_writer': {'nodes_created': {'Person': 22,\n",
       "   'Organisation': 2,\n",
       "   'Dataset': 10,\n",
       "   'Document': 29},\n",
       "  'relations_created': {'AUTHORED_BY': 35,\n",
       "   'AFFILIATED_WITH': 9,\n",
       "   'CONTRIBUTED_TO': 19,\n",
       "   'DESCRIPTION_OF': 16,\n",
       "   'LINEAGE_OF': 13}}}"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from serka.graph.embedders import OllamaNodeEmbedder\n",
    "from serka.graph.joiners import NodeJoiner\n",
    "from serka.graph.writers import Neo4jGraphWriter\n",
    "\n",
    "p = Pipeline()\n",
    "p.add_component(\"fetcher\", EIDCFetcher())\n",
    "p.add_component(\"author_extractor\", AuthorExtractor())\n",
    "p.add_component(\"orgs_extractor\", OrganisationExtractor())\n",
    "p.add_component(\"dataset_extractor\", DatasetExtractor())\n",
    "p.add_component(\"text_extractor\", TextExtractor([\"description\", \"lineage\"]))\n",
    "p.add_component(\n",
    "\t\"splitter\", DocumentSplitter(split_by=\"word\", split_length=150, split_overlap=50)\n",
    ")\n",
    "p.add_component(\n",
    "\t\"doc_emb\", OllamaDocumentEmbedder(meta_fields_to_embed=[\"title\", \"field\"])\n",
    ")\n",
    "p.add_component(\"joiner\", NodeJoiner())\n",
    "p.add_component(\"rel_extractor\", RelationshipExtractor())\n",
    "p.add_component(\"node_emb\", OllamaNodeEmbedder())\n",
    "p.add_component(\n",
    "\t\"graph_writer\", Neo4jGraphWriter(username=NEO4J_USERNAME, password=NEO4J_PASSWORD)\n",
    ")\n",
    "\n",
    "p.connect(\"fetcher\", \"author_extractor\")\n",
    "p.connect(\"fetcher\", \"orgs_extractor\")\n",
    "p.connect(\"fetcher\", \"dataset_extractor\")\n",
    "p.connect(\"fetcher\", \"rel_extractor\")\n",
    "p.connect(\"fetcher\", \"text_extractor\")\n",
    "\n",
    "p.connect(\"author_extractor\", \"joiner.authors\")\n",
    "p.connect(\"orgs_extractor\", \"joiner.orgs\")\n",
    "p.connect(\"dataset_extractor\", \"joiner.datasets\")\n",
    "\n",
    "p.connect(\"text_extractor\", \"splitter\")\n",
    "p.connect(\"splitter\", \"doc_emb\")\n",
    "p.connect(\"doc_emb\", \"graph_writer.docs\")\n",
    "\n",
    "p.connect(\"joiner\", \"node_emb\")\n",
    "p.connect(\"node_emb\", \"graph_writer.nodes\")\n",
    "p.connect(\"rel_extractor\", \"graph_writer.relations\")\n",
    "\n",
    "p.run(data={\"fetcher\": {\"rows\": 10}})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "GRAPH_PROMPT = \"\"\"\n",
    "# Overview\n",
    "You are a helpful assistant. \n",
    "You have access to a knowledge graph containing information about datasets contained in the EIDC (Environmental Information Data Centre).\n",
    "You will be given a query inputted by a user, and you need to find the most relevant information in the graph to answer it.\n",
    "You will be given a list of nodes and relationships from the knowledge graph that are most relevant to the query.\n",
    "The list of nodes and relationships will be in the format:\n",
    "```\n",
    "[{\n",
    "    'start_node': {}, # Node and it's properties that are relevant to the query\n",
    "    'start_labels': [], # A list of labels for the start node representing the type of entity it is, e.g. ['Dataset', 'Organisation', 'Person', 'TextChunk']\n",
    "    'relationship_type': \"\", # A string representing the type of relationship between the start_node and the connected_node\n",
    "    'connected_node': {}, # The node the start_node is related to, and it's properties\n",
    "    'connected_labels': [] # A list of labels for the connected_node representing the type of entity it is, e.g. ['Dataset', 'Organisation', 'Person', 'TextChunk']\n",
    "    'score': 0.0 # A float representing how relevant the start_node is to the query\n",
    "}]\n",
    "```\n",
    "\n",
    "If there is not enough information to answer the query, you should say that you cannot answer the query, instead provide a set of links to pany potentially relevant sources from the knowledge graph.\n",
    "If you can answer the question you should provide a short answer to the question, followed by list of URIs from the nodes in the knowledge graph that helped you answer the question.\n",
    "Your answer should be in the following markdown format:\n",
    "```\n",
    "# Query\n",
    "Who is the author of the smog monitoring dataset?\n",
    "\n",
    "# Answer\n",
    "The \"Smog Monitoring Dataset\"[1] was authored by \"John Doe\"[2], \"Jane Smith\"[3], and \"Alice Johnson\"[4].\n",
    "\n",
    "# References\n",
    "[1] https://doi.org/10.1234/a1235-1234-1234-6789-123456789\n",
    "[2] https://orcid.org/0000-0001-0459-506X\n",
    "[3] https://orcid.org/0000-0002-1234-306B\n",
    "[4] https://orcid.org/0000-0003-9876-302C\n",
    "```\n",
    "\n",
    "# Relevant Information\n",
    "The list of most relevant nodes and relationships from the knowledge graph is:\n",
    "```\n",
    "{{nodes}}\n",
    "```\n",
    "\n",
    "# User Query\n",
    "The query is: {{query}}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2025-04-28 15:45:46,630 - haystack.core.pipeline.pipeline - INFO - Running component embedder\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2025-04-28 15:45:46,656 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/embeddings \"HTTP/1.1 200 OK\"\n",
      "2025-04-28 15:45:46,657 - haystack.core.pipeline.pipeline - INFO - Running component reader\n",
      "2025-04-28 15:45:46,680 - haystack.core.pipeline.pipeline - INFO - Running component prompt_builder\n",
      "2025-04-28 15:45:46,680 - haystack.core.pipeline.pipeline - INFO - Running component llm\n",
      "2025-04-28 15:45:55,890 - httpx - INFO - HTTP Request: POST http://localhost:11434/api/generate \"HTTP/1.1 200 OK\"\n",
      "2025-04-28 15:45:55,893 - haystack.core.pipeline.pipeline - INFO - Running component answer_builder\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'embedder': {'meta': {'model': 'nomic-embed-text'}},\n",
       " 'llm': {'meta': [{'model': 'llama3.1',\n",
       "    'created_at': '2025-04-28T14:45:55.884403274Z',\n",
       "    'done': True,\n",
       "    'done_reason': 'stop',\n",
       "    'total_duration': 9202234847,\n",
       "    'load_duration': 19054308,\n",
       "    'prompt_eval_count': 9154,\n",
       "    'prompt_eval_duration': 3729632953,\n",
       "    'eval_count': 283,\n",
       "    'eval_duration': 5452729648,\n",
       "    'context': [128006,\n",
       "     882,\n",
       "     128007,\n",
       "     1432,\n",
       "     2,\n",
       "     35907,\n",
       "     198,\n",
       "     2675,\n",
       "     527,\n",
       "     264,\n",
       "     11190,\n",
       "     18328,\n",
       "     13,\n",
       "     720,\n",
       "     2675,\n",
       "     617,\n",
       "     2680,\n",
       "     311,\n",
       "     264,\n",
       "     6677,\n",
       "     4876,\n",
       "     8649,\n",
       "     2038,\n",
       "     922,\n",
       "     30525,\n",
       "     13282,\n",
       "     304,\n",
       "     279,\n",
       "     469,\n",
       "     926,\n",
       "     34,\n",
       "     320,\n",
       "     83166,\n",
       "     8245,\n",
       "     2956,\n",
       "     14821,\n",
       "     4390,\n",
       "     2675,\n",
       "     690,\n",
       "     387,\n",
       "     2728,\n",
       "     264,\n",
       "     3319,\n",
       "     1988,\n",
       "     6702,\n",
       "     555,\n",
       "     264,\n",
       "     1217,\n",
       "     11,\n",
       "     323,\n",
       "     499,\n",
       "     1205,\n",
       "     311,\n",
       "     1505,\n",
       "     279,\n",
       "     1455,\n",
       "     9959,\n",
       "     2038,\n",
       "     304,\n",
       "     279,\n",
       "     4876,\n",
       "     311,\n",
       "     4320,\n",
       "     433,\n",
       "     627,\n",
       "     2675,\n",
       "     690,\n",
       "     387,\n",
       "     2728,\n",
       "     264,\n",
       "     1160,\n",
       "     315,\n",
       "     7954,\n",
       "     323,\n",
       "     12135,\n",
       "     505,\n",
       "     279,\n",
       "     6677,\n",
       "     4876,\n",
       "     430,\n",
       "     527,\n",
       "     1455,\n",
       "     9959,\n",
       "     311,\n",
       "     279,\n",
       "     3319,\n",
       "     627,\n",
       "     791,\n",
       "     1160,\n",
       "     315,\n",
       "     7954,\n",
       "     323,\n",
       "     12135,\n",
       "     690,\n",
       "     387,\n",
       "     304,\n",
       "     279,\n",
       "     3645,\n",
       "     512,\n",
       "     14196,\n",
       "     4077,\n",
       "     58,\n",
       "     517,\n",
       "     262,\n",
       "     364,\n",
       "     2527,\n",
       "     5194,\n",
       "     1232,\n",
       "     16857,\n",
       "     674,\n",
       "     6146,\n",
       "     323,\n",
       "     433,\n",
       "     596,\n",
       "     6012,\n",
       "     430,\n",
       "     527,\n",
       "     9959,\n",
       "     311,\n",
       "     279,\n",
       "     3319,\n",
       "     198,\n",
       "     262,\n",
       "     364,\n",
       "     2527,\n",
       "     14889,\n",
       "     1232,\n",
       "     10277,\n",
       "     674,\n",
       "     362,\n",
       "     1160,\n",
       "     315,\n",
       "     9382,\n",
       "     369,\n",
       "     279,\n",
       "     1212,\n",
       "     2494,\n",
       "     14393,\n",
       "     279,\n",
       "     955,\n",
       "     315,\n",
       "     5502,\n",
       "     433,\n",
       "     374,\n",
       "     11,\n",
       "     384,\n",
       "     1326,\n",
       "     13,\n",
       "     2570,\n",
       "     34463,\n",
       "     518,\n",
       "     364,\n",
       "     24105,\n",
       "     8082,\n",
       "     518,\n",
       "     364,\n",
       "     10909,\n",
       "     518,\n",
       "     364,\n",
       "     1199,\n",
       "     29404,\n",
       "     4532,\n",
       "     262,\n",
       "     364,\n",
       "     37195,\n",
       "     1857,\n",
       "     1232,\n",
       "     7492,\n",
       "     674,\n",
       "     362,\n",
       "     925,\n",
       "     14393,\n",
       "     279,\n",
       "     955,\n",
       "     315,\n",
       "     5133,\n",
       "     1990,\n",
       "     279,\n",
       "     1212,\n",
       "     5194,\n",
       "     323,\n",
       "     279,\n",
       "     8599,\n",
       "     5194,\n",
       "     198,\n",
       "     262,\n",
       "     364,\n",
       "     15647,\n",
       "     5194,\n",
       "     1232,\n",
       "     16857,\n",
       "     674,\n",
       "     578,\n",
       "     2494,\n",
       "     279,\n",
       "     1212,\n",
       "     5194,\n",
       "     374,\n",
       "     5552,\n",
       "     311,\n",
       "     11,\n",
       "     323,\n",
       "     433,\n",
       "     596,\n",
       "     6012,\n",
       "     198,\n",
       "     262,\n",
       "     364,\n",
       "     15647,\n",
       "     14889,\n",
       "     1232,\n",
       "     3132,\n",
       "     674,\n",
       "     362,\n",
       "     1160,\n",
       "     315,\n",
       "     9382,\n",
       "     369,\n",
       "     279,\n",
       "     8599,\n",
       "     5194,\n",
       "     14393,\n",
       "     279,\n",
       "     955,\n",
       "     315,\n",
       "     5502,\n",
       "     433,\n",
       "     374,\n",
       "     11,\n",
       "     384,\n",
       "     1326,\n",
       "     13,\n",
       "     2570,\n",
       "     34463,\n",
       "     518,\n",
       "     364,\n",
       "     24105,\n",
       "     8082,\n",
       "     518,\n",
       "     364,\n",
       "     10909,\n",
       "     518,\n",
       "     364,\n",
       "     1199,\n",
       "     29404,\n",
       "     4532,\n",
       "     262,\n",
       "     364,\n",
       "     12618,\n",
       "     1232,\n",
       "     220,\n",
       "     15,\n",
       "     13,\n",
       "     15,\n",
       "     674,\n",
       "     362,\n",
       "     2273,\n",
       "     14393,\n",
       "     1268,\n",
       "     9959,\n",
       "     279,\n",
       "     1212,\n",
       "     5194,\n",
       "     374,\n",
       "     311,\n",
       "     279,\n",
       "     3319,\n",
       "     198,\n",
       "     58420,\n",
       "     14196,\n",
       "     19884,\n",
       "     2746,\n",
       "     1070,\n",
       "     374,\n",
       "     539,\n",
       "     3403,\n",
       "     2038,\n",
       "     311,\n",
       "     4320,\n",
       "     279,\n",
       "     3319,\n",
       "     11,\n",
       "     499,\n",
       "     1288,\n",
       "     2019,\n",
       "     430,\n",
       "     499,\n",
       "     4250,\n",
       "     4320,\n",
       "     279,\n",
       "     3319,\n",
       "     11,\n",
       "     4619,\n",
       "     3493,\n",
       "     264,\n",
       "     743,\n",
       "     315,\n",
       "     7902,\n",
       "     311,\n",
       "     281,\n",
       "     3852,\n",
       "     13893,\n",
       "     9959,\n",
       "     8336,\n",
       "     505,\n",
       "     279,\n",
       "     6677,\n",
       "     4876,\n",
       "     627,\n",
       "     2746,\n",
       "     499,\n",
       "     649,\n",
       "     4320,\n",
       "     279,\n",
       "     3488,\n",
       "     499,\n",
       "     1288,\n",
       "     3493,\n",
       "     264,\n",
       "     2875,\n",
       "     4320,\n",
       "     311,\n",
       "     279,\n",
       "     3488,\n",
       "     11,\n",
       "     8272,\n",
       "     555,\n",
       "     1160,\n",
       "     315,\n",
       "     35514,\n",
       "     3957,\n",
       "     505,\n",
       "     279,\n",
       "     7954,\n",
       "     304,\n",
       "     279,\n",
       "     6677,\n",
       "     4876,\n",
       "     430,\n",
       "     9087,\n",
       "     499,\n",
       "     4320,\n",
       "     279,\n",
       "     3488,\n",
       "     627,\n",
       "     7927,\n",
       "     4320,\n",
       "     1288,\n",
       "     387,\n",
       "     304,\n",
       "     279,\n",
       "     2768,\n",
       "     51594,\n",
       "     3645,\n",
       "     512,\n",
       "     14196,\n",
       "     4077,\n",
       "     2,\n",
       "     11615,\n",
       "     198,\n",
       "     15546,\n",
       "     374,\n",
       "     279,\n",
       "     3229,\n",
       "     315,\n",
       "     279,\n",
       "     1554,\n",
       "     540,\n",
       "     16967,\n",
       "     10550,\n",
       "     1980,\n",
       "     2,\n",
       "     22559,\n",
       "     198,\n",
       "     791,\n",
       "     330,\n",
       "     10902,\n",
       "     540,\n",
       "     51803,\n",
       "     40283,\n",
       "     37964,\n",
       "     16,\n",
       "     60,\n",
       "     574,\n",
       "     67213,\n",
       "     555,\n",
       "     330,\n",
       "     13379,\n",
       "     50728,\n",
       "     37964,\n",
       "     17,\n",
       "     1145,\n",
       "     330,\n",
       "     63602,\n",
       "     9259,\n",
       "     37964,\n",
       "     18,\n",
       "     1145,\n",
       "     323,\n",
       "     330,\n",
       "     62786,\n",
       "     11605,\n",
       "     37964,\n",
       "     19,\n",
       "     30662,\n",
       "     2,\n",
       "     45178,\n",
       "     198,\n",
       "     58,\n",
       "     16,\n",
       "     60,\n",
       "     3788,\n",
       "     1129,\n",
       "     48886,\n",
       "     2726,\n",
       "     14,\n",
       "     605,\n",
       "     13,\n",
       "     4513,\n",
       "     19,\n",
       "     14520,\n",
       "     4513,\n",
       "     20,\n",
       "     12,\n",
       "     4513,\n",
       "     19,\n",
       "     12,\n",
       "     4513,\n",
       "     19,\n",
       "     12,\n",
       "     17458,\n",
       "     24,\n",
       "     12,\n",
       "     4513,\n",
       "     10961,\n",
       "     16474,\n",
       "     198,\n",
       "     58,\n",
       "     17,\n",
       "     60,\n",
       "     3788,\n",
       "     1129,\n",
       "     269,\n",
       "     21200,\n",
       "     2726,\n",
       "     14,\n",
       "     931,\n",
       "     15,\n",
       "     12,\n",
       "     931,\n",
       "     16,\n",
       "     12,\n",
       "     23785,\n",
       "     24,\n",
       "     12,\n",
       "     19673,\n",
       "     55,\n",
       "     198,\n",
       "     58,\n",
       "     18,\n",
       "     60,\n",
       "     3788,\n",
       "     1129,\n",
       "     269,\n",
       "     21200,\n",
       "     2726,\n",
       "     14,\n",
       "     931,\n",
       "     15,\n",
       "     12,\n",
       "     931,\n",
       "     17,\n",
       "     12,\n",
       "     4513,\n",
       "     19,\n",
       "     12,\n",
       "     12879,\n",
       "     33,\n",
       "     198,\n",
       "     58,\n",
       "     19,\n",
       "     60,\n",
       "     3788,\n",
       "     1129,\n",
       "     269,\n",
       "     21200,\n",
       "     2726,\n",
       "     14,\n",
       "     931,\n",
       "     15,\n",
       "     12,\n",
       "     931,\n",
       "     18,\n",
       "     12,\n",
       "     22207,\n",
       "     21,\n",
       "     12,\n",
       "     13121,\n",
       "     34,\n",
       "     198,\n",
       "     14196,\n",
       "     19884,\n",
       "     2,\n",
       "     88516,\n",
       "     8245,\n",
       "     198,\n",
       "     791,\n",
       "     1160,\n",
       "     315,\n",
       "     1455,\n",
       "     9959,\n",
       "     7954,\n",
       "     323,\n",
       "     12135,\n",
       "     505,\n",
       "     279,\n",
       "     6677,\n",
       "     4876,\n",
       "     374,\n",
       "     512,\n",
       "     14196,\n",
       "     4077,\n",
       "     58,\n",
       "     13922,\n",
       "     2527,\n",
       "     5194,\n",
       "     1232,\n",
       "     5473,\n",
       "     2150,\n",
       "     1232,\n",
       "     364,\n",
       "     63862,\n",
       "     1094,\n",
       "     13790,\n",
       "     4519,\n",
       "     12914,\n",
       "     11,\n",
       "     8681,\n",
       "     13527,\n",
       "     348,\n",
       "     13,\n",
       "     16,\n",
       "     13,\n",
       "     15,\n",
       "     518,\n",
       "     364,\n",
       "     6198,\n",
       "     1232,\n",
       "     364,\n",
       "     2485,\n",
       "     1129,\n",
       "     48886,\n",
       "     2726,\n",
       "     14,\n",
       "     605,\n",
       "     13,\n",
       "     21458,\n",
       "     20,\n",
       "     3529,\n",
       "     22,\n",
       "     3315,\n",
       "     21,\n",
       "     7369,\n",
       "     24,\n",
       "     12,\n",
       "     6849,\n",
       "     65,\n",
       "     12,\n",
       "     19,\n",
       "     15245,\n",
       "     1481,\n",
       "     22874,\n",
       "     1824,\n",
       "     16,\n",
       "     69,\n",
       "     22,\n",
       "     4749,\n",
       "     6281,\n",
       "     11032,\n",
       "     845,\n",
       "     25762,\n",
       "     364,\n",
       "     2527,\n",
       "     14889,\n",
       "     1232,\n",
       "     2570,\n",
       "     70964,\n",
       "     518,\n",
       "     364,\n",
       "     34463,\n",
       "     4181,\n",
       "     364,\n",
       "     37195,\n",
       "     1857,\n",
       "     1232,\n",
       "     364,\n",
       "     8429,\n",
       "     3669,\n",
       "     14568,\n",
       "     518,\n",
       "     364,\n",
       "     15647,\n",
       "     5194,\n",
       "     1232,\n",
       "     5473,\n",
       "     1834,\n",
       "     1232,\n",
       "     364,\n",
       "     1527,\n",
       "     420,\n",
       "     16997,\n",
       "     2673,\n",
       "     828,\n",
       "     1701,\n",
       "     57240,\n",
       "     369,\n",
       "     2204,\n",
       "     54832,\n",
       "     2673,\n",
       "     8365,\n",
       "     369,\n",
       "     264,\n",
       "     2728,\n",
       "     3160,\n",
       "     315,\n",
       "     19254,\n",
       "     11,\n",
       "     32125,\n",
       "     25,\n",
       "     8187,\n",
       "     54832,\n",
       "     2673,\n",
       "     482,\n",
       "     15,\n",
       "     13,\n",
       "     1032,\n",
       "     296,\n",
       "     320,\n",
       "     4711,\n",
       "     287,\n",
       "     369,\n",
       "     279,\n",
       "     9546,\n",
       "     315,\n",
       "     264,\n",
       "     50104,\n",
       "     24894,\n",
       "     311,\n",
       "     279,\n",
       "     24670,\n",
       "     1094,\n",
       "     4668,\n",
       "     8,\n",
       "     311,\n",
       "     7340,\n",
       "     54832,\n",
       "     2673,\n",
       "     220,\n",
       "     2970,\n",
       "     296,\n",
       "     320,\n",
       "     1820,\n",
       "     7340,\n",
       "     2673,\n",
       "     369,\n",
       "     264,\n",
       "     5021,\n",
       "     304,\n",
       "     19397,\n",
       "     705,\n",
       "     323,\n",
       "     3152,\n",
       "     54832,\n",
       "     2673,\n",
       "     220,\n",
       "     15,\n",
       "     13,\n",
       "     2970,\n",
       "     296,\n",
       "     320,\n",
       "     4711,\n",
       "     287,\n",
       "     369,\n",
       "     342,\n",
       "     11392,\n",
       "     4519,\n",
       "     570,\n",
       "     220,\n",
       "     578,\n",
       "     10550,\n",
       "     18911,\n",
       "     13790,\n",
       "     4519,\n",
       "     902,\n",
       "     617,\n",
       "     264,\n",
       "     1579,\n",
       "     29736,\n",
       "     315,\n",
       "     1694,\n",
       "     264,\n",
       "     24670,\n",
       "     1094,\n",
       "     13790,\n",
       "     4668,\n",
       "     16045,\n",
       "     364,\n",
       "     5349,\n",
       "     851,\n",
       "     1232,\n",
       "     364,\n",
       "     21600,\n",
       "     26439,\n",
       "     36934,\n",
       "     17,\n",
       "     2042,\n",
       "     16085,\n",
       "     19319,\n",
       "     24574,\n",
       "     22,\n",
       "     830,\n",
       "     20973,\n",
       "     8393,\n",
       "     1399,\n",
       "     68,\n",
       "     25358,\n",
       "     20417,\n",
       "     11057,\n",
       "     3716,\n",
       "     19,\n",
       "     64,\n",
       "     16,\n",
       "     4484,\n",
       "     1987,\n",
       "     66,\n",
       "     23,\n",
       "     65,\n",
       "     20,\n",
       "     64,\n",
       "     17887,\n",
       "     19,\n",
       "     15245,\n",
       "     18,\n",
       "     25762,\n",
       "     364,\n",
       "     15647,\n",
       "     14889,\n",
       "     1232,\n",
       "     2570,\n",
       "     70964,\n",
       "     518,\n",
       "     364,\n",
       "     1199,\n",
       "     29404,\n",
       "     4181,\n",
       "     364,\n",
       "     12618,\n",
       "     1232,\n",
       "     220,\n",
       "     15,\n",
       "     13,\n",
       "     4728,\n",
       "     23873,\n",
       "     22005,\n",
       "     6550,\n",
       "     27341,\n",
       "     2186,\n",
       "     5473,\n",
       "     2527,\n",
       "     5194,\n",
       "     1232,\n",
       "     5473,\n",
       "     2150,\n",
       "     1232,\n",
       "     364,\n",
       "     63862,\n",
       "     1094,\n",
       "     13790,\n",
       "     4519,\n",
       "     12914,\n",
       "     11,\n",
       "     8681,\n",
       "     13527,\n",
       "     348,\n",
       "     13,\n",
       "     16,\n",
       "     13,\n",
       "     15,\n",
       "     518,\n",
       "     364,\n",
       "     6198,\n",
       "     1232,\n",
       "     364,\n",
       "     2485,\n",
       "     1129,\n",
       "     48886,\n",
       "     2726,\n",
       "     14,\n",
       "     605,\n",
       "     13,\n",
       "     21458,\n",
       "     20,\n",
       "     3529,\n",
       "     22,\n",
       "     3315,\n",
       "     21,\n",
       "     7369,\n",
       "     24,\n",
       "     12,\n",
       "     6849,\n",
       "     65,\n",
       "     12,\n",
       "     19,\n",
       "     15245,\n",
       "     1481,\n",
       "     22874,\n",
       "     1824,\n",
       "     16,\n",
       "     69,\n",
       "     22,\n",
       "     4749,\n",
       "     6281,\n",
       "     11032,\n",
       "     845,\n",
       "     25762,\n",
       "     364,\n",
       "     2527,\n",
       "     14889,\n",
       "     1232,\n",
       "     2570,\n",
       "     70964,\n",
       "     518,\n",
       "     364,\n",
       "     34463,\n",
       "     4181,\n",
       "     364,\n",
       "     37195,\n",
       "     1857,\n",
       "     1232,\n",
       "     364,\n",
       "     8429,\n",
       "     3669,\n",
       "     14568,\n",
       "     518,\n",
       "     364,\n",
       "     15647,\n",
       "     5194,\n",
       "     1232,\n",
       "     5473,\n",
       "     1834,\n",
       "     1232,\n",
       "     364,\n",
       "     791,\n",
       "     10550,\n",
       "     374,\n",
       "     279,\n",
       "     2612,\n",
       "     505,\n",
       "     264,\n",
       "     1646,\n",
       "     902,\n",
       "     538,\n",
       "     9803,\n",
       "     279,\n",
       "     8365,\n",
       "     315,\n",
       "     1855,\n",
       "     13790,\n",
       "     4668,\n",
       "     2949,\n",
       "     264,\n",
       "     13790,\n",
       "     12914,\n",
       "     320,\n",
       "     31039,\n",
       "     5304,\n",
       "     279,\n",
       "     44899,\n",
       "     2373,\n",
       "     315,\n",
       "     2582,\n",
       "     17851,\n",
       "     685,\n",
       "     24507,\n",
       "     11060,\n",
       "     2276,\n",
       "     73441,\n",
       "     77,\n",
       "     1734,\n",
       "     791,\n",
       "     2768,\n",
       "     5603,\n",
       "     574,\n",
       "     4529,\n",
       "     7338,\n",
       "     83,\n",
       "     72337,\n",
       "     315,\n",
       "     279,\n",
       "     12914,\n",
       "     1051,\n",
       "     43248,\n",
       "     704,\n",
       "     1405,\n",
       "     24670,\n",
       "     1094,\n",
       "     13790,\n",
       "     4519,\n",
       "     1051,\n",
       "     17821,\n",
       "     311,\n",
       "     387,\n",
       "     1766,\n",
       "     477,\n",
       "     1405,\n",
       "     433,\n",
       "     1053,\n",
       "     387,\n",
       "     12266,\n",
       "     311,\n",
       "     11388,\n",
       "     1124,\n",
       "     11,\n",
       "     602,\n",
       "     1770,\n",
       "     13,\n",
       "     1405,\n",
       "     4363,\n",
       "     574,\n",
       "     5190,\n",
       "     1109,\n",
       "     220,\n",
       "     8652,\n",
       "     296,\n",
       "     11,\n",
       "     16036,\n",
       "     11,\n",
       "     94471,\n",
       "     477,\n",
       "     304,\n",
       "     264,\n",
       "     35335,\n",
       "     43038,\n",
       "     2695,\n",
       "     13883,\n",
       "     3158,\n",
       "     13,\n",
       "     10293,\n",
       "     11680,\n",
       "     12,\n",
       "     1876,\n",
       "     73381,\n",
       "     878,\n",
       "     39200,\n",
       "     7586,\n",
       "     10190,\n",
       "     1049,\n",
       "     22,\n",
       "     1051,\n",
       "     1511,\n",
       "     311,\n",
       "     656,\n",
       "     420,\n",
       "     13,\n",
       "     220,\n",
       "     77516,\n",
       "     2673,\n",
       "     2038,\n",
       "     574,\n",
       "     16997,\n",
       "     505,\n",
       "     264,\n",
       "     423,\n",
       "     22809,\n",
       "     320,\n",
       "     71550,\n",
       "     2276,\n",
       "     220,\n",
       "     20,\n",
       "     76,\n",
       "     570,\n",
       "     220,\n",
       "     38276,\n",
       "     5548,\n",
       "     449,\n",
       "     24670,\n",
       "     1094,\n",
       "     13790,\n",
       "     4519,\n",
       "     1051,\n",
       "     11054,\n",
       "     505,\n",
       "     420,\n",
       "     16997,\n",
       "     2673,\n",
       "     828,\n",
       "     1701,\n",
       "     57240,\n",
       "     369,\n",
       "     2204,\n",
       "     ...]}]},\n",
       " 'answer_builder': {'answers': [GeneratedAnswer(data='# Query\\nWhat are some datasets available in the EIDC?\\n\\n# Answer\\nSome datasets available in the Environmental Information Data Centre (EIDC) include:\\n\\n* Woody linear features framework, Great Britain v.1.0\\n* Land Cover Map 2000 (vector, N.Ireland)\\n* United Kingdom Butterfly Monitoring Scheme: collated indices 2023\\n* Land Cover Map 2021 (land parcels, GB)\\n* Land Cover Map 2023 (land parcels, GB)\\n\\n# References\\n[1] https://doi.org/10.5285/d7da6cb9-104b-4dbc-b709-c1f7ba94fb16\\n[2] https://doi.org/10.5285/9f043047-d1c7-4852-b513-aa00204022a8\\n[3] https://doi.org/10.5285/7869969c-ac2d-450e-97c6-79d3d6a22a57\\n[4] https://doi.org/10.5285/398dd41e-3c08-47f5-811f-da990007643f\\n[5] https://doi.org/10.5285/50b344eb-8343-423b-8b2f-0e9800e34bbd', query='\\n# Overview\\nYou are a helpful assistant. \\nYou have access to a knowledge graph containing information about datasets contained in the EIDC (Environmental Information Data Centre).\\nYou will be given a query inputted by a user, and you need to find the most relevant information in the graph to answer it.\\nYou will be given a list of nodes and relationships from the knowledge graph that are most relevant to the query.\\nThe list of nodes and relationships will be in the format:\\n```\\n[{\\n    \\'start_node\\': {}, # Node and it\\'s properties that are relevant to the query\\n    \\'start_labels\\': [], # A list of labels for the start node representing the type of entity it is, e.g. [\\'Dataset\\', \\'Organisation\\', \\'Person\\', \\'TextChunk\\']\\n    \\'relationship_type\\': \"\", # A string representing the type of relationship between the start_node and the connected_node\\n    \\'connected_node\\': {}, # The node the start_node is related to, and it\\'s properties\\n    \\'connected_labels\\': [] # A list of labels for the connected_node representing the type of entity it is, e.g. [\\'Dataset\\', \\'Organisation\\', \\'Person\\', \\'TextChunk\\']\\n    \\'score\\': 0.0 # A float representing how relevant the start_node is to the query\\n}]\\n```\\n\\nIf there is not enough information to answer the query, you should say that you cannot answer the query, instead provide a set of links to pany potentially relevant sources from the knowledge graph.\\nIf you can answer the question you should provide a short answer to the question, followed by list of URIs from the nodes in the knowledge graph that helped you answer the question.\\nYour answer should be in the following markdown format:\\n```\\n# Query\\nWho is the author of the smog monitoring dataset?\\n\\n# Answer\\nThe \"Smog Monitoring Dataset\"[1] was authored by \"John Doe\"[2], \"Jane Smith\"[3], and \"Alice Johnson\"[4].\\n\\n# References\\n[1] https://doi.org/10.1234/a1235-1234-1234-6789-123456789\\n[2] https://orcid.org/0000-0001-0459-506X\\n[3] https://orcid.org/0000-0002-1234-306B\\n[4] https://orcid.org/0000-0003-9876-302C\\n```\\n\\n# Relevant Information\\nThe list of most relevant nodes and relationships from the knowledge graph is:\\n```\\n[{\\'start_node\\': {\\'title\\': \\'Woody linear features framework, Great Britain v.1.0\\', \\'uri\\': \\'https://doi.org/10.5285/d7da6cb9-104b-4dbc-b709-c1f7ba94fb16\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'LINEAGE_OF\\', \\'connected_node\\': {\\'content\\': \\'from this calculated height data using thresholds for different vegetation height attributes for a given length of boundary, namely: minimum vegetation height -0.13 m (accounting for the presence of a ditch adjacent to the woody feature) to maximum vegetation height 58 m (the maximum height for a tree in GB), and mean vegetation height 0.58 m (accounting for gappy features).  The dataset presents linear features which have a high likelihood of being a woody linear feature.\\', \\'doc_id\\': \\'536759afa2db2839015977ef611abe60e766804225fa4a1cd38c8b5a3394dbc3\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.800877571105957}, {\\'start_node\\': {\\'title\\': \\'Woody linear features framework, Great Britain v.1.0\\', \\'uri\\': \\'https://doi.org/10.5285/d7da6cb9-104b-4dbc-b709-c1f7ba94fb16\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'LINEAGE_OF\\', \\'connected_node\\': {\\'content\\': \\'The dataset is the output from a model which classifies the attributes of each linear feature within a linear framework (based upon the simplified version of Ordnance Survey MasterMap).\\\\n\\\\nThe following approach was taken:\\\\tAreas of the framework were masked out where woody linear features were unlikely to be found or where it would be impossible to detect them, i.e. where land was higher than 350 m, urban, wooded or in a coastal tide-washed area. OS Land-Form PANORAMA/LCM2007 were used to do this.  Boundary height information was calculated from a DTM (NEXTMap 5m).  Boundaries with woody linear features were identified from this calculated height data using thresholds for different vegetation height attributes for a given length of boundary, namely: minimum vegetation height -0.13 m (accounting for the presence of a ditch adjacent to the woody feature) to maximum vegetation height 58 m (the maximum height for a tree in GB), \\', \\'doc_id\\': \\'cd15f111f8f9e1c3ba1d77bc8d30647ab5c1bb763c503fd2b32918ec2941e06d\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.800877571105957}, {\\'start_node\\': {\\'title\\': \\'Woody linear features framework, Great Britain v.1.0\\', \\'uri\\': \\'https://doi.org/10.5285/d7da6cb9-104b-4dbc-b709-c1f7ba94fb16\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'CONTRIBUTED_TO\\', \\'connected_node\\': {\\'name\\': \\'NERC EDS Environmental Information Data Centre\\', \\'uri\\': \\'https://ror.org/04xw4m193\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Organisation\\'], \\'score\\': 0.800877571105957}, {\\'start_node\\': {\\'title\\': \\'Woody linear features framework, Great Britain v.1.0\\', \\'uri\\': \\'https://doi.org/10.5285/d7da6cb9-104b-4dbc-b709-c1f7ba94fb16\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'CONTRIBUTED_TO\\', \\'connected_node\\': {\\'name\\': \\'UK Centre for Ecology & Hydrology\\', \\'uri\\': \\'https://ror.org/00pggkr55\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Organisation\\'], \\'score\\': 0.800877571105957}, {\\'start_node\\': {\\'title\\': \\'Woody linear features framework, Great Britain v.1.0\\', \\'uri\\': \\'https://doi.org/10.5285/d7da6cb9-104b-4dbc-b709-c1f7ba94fb16\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'DESCRIPTION_OF\\', \\'connected_node\\': {\\'content\\': \\'A modelled dataset derived from a range of national datasets, describing the distribution of woody linear feature boundaries in Great Britain.  The dataset presents linear features which have a high likelihood of being a woody linear feature.  The dataset was created by a predictive model developed at the Centre for Ecology & Hydrology, Lancaster in 2016.\\', \\'doc_id\\': \\'dc5ec861305f2809ad1e6ea52d534172f35e4f1d9fd768dc3da1b6c16b0c6fd1\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.800877571105957}, {\\'start_node\\': {\\'title\\': \\'Woody linear features framework, Great Britain v.1.0\\', \\'uri\\': \\'https://doi.org/10.5285/d7da6cb9-104b-4dbc-b709-c1f7ba94fb16\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'L.R.\\', \\'surname\\': \\'Howard\\', \\'uri\\': \\'https://orcid.org/0000-0003-4494-7450\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.800877571105957}, {\\'start_node\\': {\\'title\\': \\'Woody linear features framework, Great Britain v.1.0\\', \\'uri\\': \\'https://doi.org/10.5285/d7da6cb9-104b-4dbc-b709-c1f7ba94fb16\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'P.A.\\', \\'surname\\': \\'Henrys\\', \\'uri\\': \\'https://orcid.org/0000-0003-4758-1482\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.800877571105957}, {\\'start_node\\': {\\'title\\': \\'Woody linear features framework, Great Britain v.1.0\\', \\'uri\\': \\'https://doi.org/10.5285/d7da6cb9-104b-4dbc-b709-c1f7ba94fb16\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'C.S.\\', \\'surname\\': \\'Rowland\\', \\'uri\\': \\'https://orcid.org/0000-0002-0459-506X\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.800877571105957}, {\\'start_node\\': {\\'title\\': \\'Woody linear features framework, Great Britain v.1.0\\', \\'uri\\': \\'https://doi.org/10.5285/d7da6cb9-104b-4dbc-b709-c1f7ba94fb16\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'R.D.\\', \\'surname\\': \\'Morton\\', \\'uri\\': \\'https://orcid.org/0000-0003-3947-6463\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.800877571105957}, {\\'start_node\\': {\\'title\\': \\'Woody linear features framework, Great Britain v.1.0\\', \\'uri\\': \\'https://doi.org/10.5285/d7da6cb9-104b-4dbc-b709-c1f7ba94fb16\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'P.A.\\', \\'surname\\': \\'Scholefield\\', \\'uri\\': \\'https://orcid.org/0000-0003-2974-6431\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.800877571105957}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2000 (vector, N.Ireland)\\', \\'uri\\': \\'https://doi.org/10.5285/9f043047-d1c7-4852-b513-aa00204022a8\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'LINEAGE_OF\\', \\'connected_node\\': {\\'content\\': \\'treated as GIS objects to which attribute data could then be attached covering such topics as land cover class, parcel area, length of boundary, processing history, knowledge-based correction and identification of the original satellite scene. LCM2000 was produced at CEH Monks Wood. For further information on the methodology developed and used to create Land Cover Map 2000, see on-line supporting documentation.\\', \\'doc_id\\': \\'bc7274753f31d7cbb787e2255fe4fd84730d480d39de30d843ad89259c428fe3\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.8003878593444824}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2000 (vector, N.Ireland)\\', \\'uri\\': \\'https://doi.org/10.5285/9f043047-d1c7-4852-b513-aa00204022a8\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'CONTRIBUTED_TO\\', \\'connected_node\\': {\\'name\\': \\'UK Centre for Ecology & Hydrology\\', \\'uri\\': \\'https://ror.org/00pggkr55\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Organisation\\'], \\'score\\': 0.8003878593444824}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2000 (vector, N.Ireland)\\', \\'uri\\': \\'https://doi.org/10.5285/9f043047-d1c7-4852-b513-aa00204022a8\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'DESCRIPTION_OF\\', \\'connected_node\\': {\\'content\\': \"This dataset consists of the vector version of the Land Cover Map 2000 for Northern Ireland, containing individual parcels of land cover (the highest available resolution). Level 2 & Level 3 attributes are available. Level 2, the standard level of detail, provides 26 LCM2000 target or (\\'sub\\') classes. This is the most widely used version of the dataset. Level 3 gives higher class detail. However, the quality of this level of detail may vary in different areas of the country, requiring expert interpretation. The dataset is part of a series of data products produced by the Centre for Ecology & Hydrology known as LCM2000. LCM2000 is a parcel-based thematic classification of satellite image data covering the entire United Kingdom. LCM2000 is derived from a computer classification of satellite scenes obtained mainly from Landsat, IRS and SPOT sensors and also incorporates information derived from other ancillary datasets. LCM2000 was classified using \", \\'doc_id\\': \\'02b8a7ae0fe9976039e38165af8b0c1ce214fc1fdf4b64491c14c806b9efceb6\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.8003878593444824}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2000 (vector, N.Ireland)\\', \\'uri\\': \\'https://doi.org/10.5285/9f043047-d1c7-4852-b513-aa00204022a8\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'CONTRIBUTED_TO\\', \\'connected_node\\': {\\'name\\': \\'NERC EDS Environmental Information Data Centre\\', \\'uri\\': \\'https://ror.org/04xw4m193\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Organisation\\'], \\'score\\': 0.8003878593444824}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2000 (vector, N.Ireland)\\', \\'uri\\': \\'https://doi.org/10.5285/9f043047-d1c7-4852-b513-aa00204022a8\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'DESCRIPTION_OF\\', \\'connected_node\\': {\\'content\\': \\'Hydrology known as LCM2000. LCM2000 is a parcel-based thematic classification of satellite image data covering the entire United Kingdom. LCM2000 is derived from a computer classification of satellite scenes obtained mainly from Landsat, IRS and SPOT sensors and also incorporates information derived from other ancillary datasets. LCM2000 was classified using a nomenclature corresponding to the Joint Nature Conservation Committee (JNCC) Broad Habitats, which encompasses the entire range of UK habitats. In addition, it recorded further detail where possible. The series of LCM2000 products includes vector and raster formats, with a number of different versions containing varying levels of detail and at different spatial resolutions.\\', \\'doc_id\\': \\'0a94ad3571ef6d8445c02a694b1037419f0e3e8d974ccef8d06a77530836e580\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.8003878593444824}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2000 (vector, N.Ireland)\\', \\'uri\\': \\'https://doi.org/10.5285/9f043047-d1c7-4852-b513-aa00204022a8\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'LINEAGE_OF\\', \\'connected_node\\': {\\'content\\': \"In a major development to earlier methods, LCM2000 used image segmentation to identify land parcels in the pixel-based images. An automated procedure grouped the image pixels into spectrally \\'uniform\\' segments. These were built around \\'seedpoints\\' selected to avoid parcel boundaries. The segmentation recorded a field-by-field pattern, also separating land use zones within urban and suburban areas, and subdividing mosaics of semi-natural vegetation. Generalisation gave minimum mappable units of a half hectare. A \\'vector\\' version was then created in the geographical information system (GIS), where the boundaries between the pixel-based segments were represented by digital linework. The resultant land parcels were treated as GIS objects to which attribute data could then be attached covering such topics as land cover class, parcel area, length of boundary, processing history, knowledge-based correction and identification of the original satellite scene. LCM2000 was produced at CEH Monks Wood. For further information on the methodology developed and \", \\'doc_id\\': \\'4d21aa60f07d5035e6737b0d81f1d960814eb9b0feee71b73973d42c685ddd35\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.8003878593444824}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2000 (vector, N.Ireland)\\', \\'uri\\': \\'https://doi.org/10.5285/9f043047-d1c7-4852-b513-aa00204022a8\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'R.M.\\', \\'surname\\': \\'Fuller\\', \\'uri\\': \\'https://orcid.org/0000-0001-5916-5174\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.8003878593444824}, {\\'start_node\\': {\\'title\\': \\'United Kingdom Butterfly Monitoring Scheme: collated indices 2023\\', \\'uri\\': \\'https://doi.org/10.5285/7869969c-ac2d-450e-97c6-79d3d6a22a57\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'DESCRIPTION_OF\\', \\'connected_node\\': {\\'content\\': \\'been recorded on five or more sites in that year. Indices are calculated at UK level and at individual country level for England, Scotland, Wales and Northern Ireland where sufficient data are available. Based on this criterion, collated indices have been calculated for the entire time series from 1976 (UK, England and Wales), 1979 (Scotland) and 2004 (Northern Ireland) to the current year for the majority of species, but for some rarer species this has not been possible in some years, particular those in the first part of the time series. Collated indices are calculated using a log-linear model incorporating individual site indices from all monitored sites across the UK or country for a given species in a given year. The number of sites for each species ranges from 5 to several hundred or more and fluctuates from year to year. By 2010 almost 2,000 sites were monitored in total \\', \\'doc_id\\': \\'6f742db7d15564796a85a93a005498197d5d2a776a10d031483d8d069fb9a4ee\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.7979192733764648}, {\\'start_node\\': {\\'title\\': \\'United Kingdom Butterfly Monitoring Scheme: collated indices 2023\\', \\'uri\\': \\'https://doi.org/10.5285/7869969c-ac2d-450e-97c6-79d3d6a22a57\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'LINEAGE_OF\\', \\'connected_node\\': {\\'content\\': \"Collated indices are produced using a series of statistical models on butterfly transect counts recorded by a volunteer network. These indices are a relative measure of each species\\' abundance across the UK compared to the baseline in 1976. The statistics are presented as log10 values. These values are centred around an arbitrary value of 2 as a mean for the time series in order to help show which years are below or above average (a technique used in other biodiversity indicators).\", \\'doc_id\\': \\'3e68f64df3d8083e1cd5fcd4c620d943c8c248bc080297b01308265d03ec4383\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.7979192733764648}, {\\'start_node\\': {\\'title\\': \\'United Kingdom Butterfly Monitoring Scheme: collated indices 2023\\', \\'uri\\': \\'https://doi.org/10.5285/7869969c-ac2d-450e-97c6-79d3d6a22a57\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'DESCRIPTION_OF\\', \\'connected_node\\': {\\'content\\': \\'Collated indices are a relative measure of butterfly abundance across sites monitored as part of the UK Butterfly Monitoring Scheme. Data from all survey sites (standard UKBMS transects, Wider Countryside Survey transects and targeted species surveys such as timed, larval web and egg counts) are used in the calculation of these indices. The statistics are presented as log10 values. These values are centred round an arbitrary value of 2 as a mean for the time series in order to help show which years are below or above average. Collated indices are calculated annually for each individual butterfly species that has been recorded on five or more sites in that year. Indices are calculated at UK level and at individual country level for England, Scotland, Wales and Northern Ireland where sufficient data are available. Based on this criterion, collated indices have been calculated for the entire time series from 1976 (UK, \\', \\'doc_id\\': \\'8d3920a0036961cd8730b36a5109394176a096ad55295e26e5563f1a7b8f527b\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.7979192733764648}, {\\'start_node\\': {\\'title\\': \\'United Kingdom Butterfly Monitoring Scheme: collated indices 2023\\', \\'uri\\': \\'https://doi.org/10.5285/7869969c-ac2d-450e-97c6-79d3d6a22a57\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'CONTRIBUTED_TO\\', \\'connected_node\\': {\\'name\\': \\'NERC EDS Environmental Information Data Centre\\', \\'uri\\': \\'https://ror.org/04xw4m193\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Organisation\\'], \\'score\\': 0.7979192733764648}, {\\'start_node\\': {\\'title\\': \\'United Kingdom Butterfly Monitoring Scheme: collated indices 2023\\', \\'uri\\': \\'https://doi.org/10.5285/7869969c-ac2d-450e-97c6-79d3d6a22a57\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'DESCRIPTION_OF\\', \\'connected_node\\': {\\'content\\': \\'individual site indices from all monitored sites across the UK or country for a given species in a given year. The number of sites for each species ranges from 5 to several hundred or more and fluctuates from year to year. By 2010 almost 2,000 sites were monitored in total across the UK, with this number rising to more than 3,000 over the next decade.\\\\n\\\\nCollated indices are calculated so that we can determine how butterfly populations are changing over time across the UK. This data can be used, for example, to determine where to target conservation efforts and more generally the condition of the UK countryside. Butterflies are recognised as important indicators of biodiversity and environmental change, for example in UK and country Biodiversity Indicators, and have been used in numerous studies of the impacts of climate and habitat change on biodiversity.\\\\n\\\\nThe UK Butterfly Monitoring Scheme is organized and funded \\', \\'doc_id\\': \\'229fe2cc2c3a3ba92511380b24fba9f5fe06284bf7edc0ee7dc7a4fc92b0b9c9\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.7979192733764648}, {\\'start_node\\': {\\'title\\': \\'United Kingdom Butterfly Monitoring Scheme: collated indices 2023\\', \\'uri\\': \\'https://doi.org/10.5285/7869969c-ac2d-450e-97c6-79d3d6a22a57\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'DESCRIPTION_OF\\', \\'connected_node\\': {\\'content\\': \\'the condition of the UK countryside. Butterflies are recognised as important indicators of biodiversity and environmental change, for example in UK and country Biodiversity Indicators, and have been used in numerous studies of the impacts of climate and habitat change on biodiversity.\\\\n\\\\nThe UK Butterfly Monitoring Scheme is organized and funded by Butterfly Conservation (BC), the UK Centre for Ecology & Hydrology (UKCEH), the British Trust for Ornithology (BTO), and the Joint Nature Conservation Committee (JNCC). The UKBMS is indebted to all volunteers who contribute data to the scheme.\\\\n\\\\nThis work was supported by the Natural Environment Research Council award number NE/R016429/1 as part of the UK-SCAPE programme delivering National Capability.\\\\n\\', \\'doc_id\\': \\'4a9e6fabfaded3e0c8ef127f58501e25064fbf5c24888e4dbc51873aaa639154\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.7979192733764648}, {\\'start_node\\': {\\'title\\': \\'United Kingdom Butterfly Monitoring Scheme: collated indices 2023\\', \\'uri\\': \\'https://doi.org/10.5285/7869969c-ac2d-450e-97c6-79d3d6a22a57\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'CONTRIBUTED_TO\\', \\'connected_node\\': {\\'name\\': \\'UK Centre for Ecology & Hydrology\\', \\'uri\\': \\'https://ror.org/00pggkr55\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Organisation\\'], \\'score\\': 0.7979192733764648}, {\\'start_node\\': {\\'title\\': \\'United Kingdom Butterfly Monitoring Scheme: collated indices 2023\\', \\'uri\\': \\'https://doi.org/10.5285/7869969c-ac2d-450e-97c6-79d3d6a22a57\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'C.\\', \\'surname\\': \\'Harrower\\', \\'uri\\': \\'https://orcid.org/0000-0002-5147-0331\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.7979192733764648}, {\\'start_node\\': {\\'title\\': \\'United Kingdom Butterfly Monitoring Scheme: collated indices 2023\\', \\'uri\\': \\'https://doi.org/10.5285/7869969c-ac2d-450e-97c6-79d3d6a22a57\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'J.\\', \\'surname\\': \\'Heywood\\', \\'uri\\': \\'https://orcid.org/0000-0001-5070-5293\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.7979192733764648}, {\\'start_node\\': {\\'title\\': \\'United Kingdom Butterfly Monitoring Scheme: collated indices 2023\\', \\'uri\\': \\'https://doi.org/10.5285/7869969c-ac2d-450e-97c6-79d3d6a22a57\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'I.\\', \\'surname\\': \\'Middlebrook\\', \\'uri\\': \\'https://orcid.org/0000-0002-0448-9144\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.7979192733764648}, {\\'start_node\\': {\\'title\\': \\'United Kingdom Butterfly Monitoring Scheme: collated indices 2023\\', \\'uri\\': \\'https://doi.org/10.5285/7869969c-ac2d-450e-97c6-79d3d6a22a57\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'M.S.\\', \\'surname\\': \\'Botham\\', \\'uri\\': \\'https://orcid.org/0000-0002-5276-1405\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.7979192733764648}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2021 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/398dd41e-3c08-47f5-811f-da990007643f\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'DESCRIPTION_OF\\', \\'connected_node\\': {\\'content\\': \\'This is a vector data set representing the land surface of Great Britain, classified into 21 UKCEH land cover classes, based upon Biodiversity Action Plan broad habitats. This vector Land Parcel dataset is the result of intersecting the 10m raster classified pixel datasets with the UKCEH Land Parcel Spatial Framework to generate summary land parcel attributes for each land cover parcel. A full description of this and all UKCEH LCM2021 products are available from the LCM2021 product documentation accompanying this dataset.\\', \\'doc_id\\': \\'3db41d4249069f20dddd740af87e4af46b348bcedf52c0264fcd0e3512be128f\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.794011116027832}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2021 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/398dd41e-3c08-47f5-811f-da990007643f\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'CONTRIBUTED_TO\\', \\'connected_node\\': {\\'name\\': \\'UK Centre for Ecology & Hydrology\\', \\'uri\\': \\'https://ror.org/00pggkr55\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Organisation\\'], \\'score\\': 0.794011116027832}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2021 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/398dd41e-3c08-47f5-811f-da990007643f\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'CONTRIBUTED_TO\\', \\'connected_node\\': {\\'name\\': \\'NERC EDS Environmental Information Data Centre\\', \\'uri\\': \\'https://ror.org/04xw4m193\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Organisation\\'], \\'score\\': 0.794011116027832}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2021 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/398dd41e-3c08-47f5-811f-da990007643f\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'LINEAGE_OF\\', \\'connected_node\\': {\\'content\\': \"UKCEH\\'s automated land cover algorithms classify 10 m pixels across the whole of UK. Training data were automatically selected from stable land covers over the interval of 2018 to 2020. A Random Forest classifier used these to classify four composite images representing per season median surface reflectance. Seasonal images were integrated with context layers (e.g., height, aspect, slope, coastal proximity, urban proximity and so forth) to reduce confusion among classes with similar spectra. \\\\n\\\\nLand cover was validated by organising the 10 m pixel classification into a land parcel framework (the LCM2021 classified land parcels product). The classified land parcels were compared to known land cover producing a confusion matrix to determine overall and per class accuracy. Details are available from the product documentation accompanying this dataset.\", \\'doc_id\\': \\'aca490a055f25d6fd7d535946d245cce3923ee6ce76443f111a932c3e3708123\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.794011116027832}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2021 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/398dd41e-3c08-47f5-811f-da990007643f\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'R.D.\\', \\'surname\\': \\'Morton\\', \\'uri\\': \\'https://orcid.org/0000-0003-3947-6463\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.794011116027832}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2021 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/398dd41e-3c08-47f5-811f-da990007643f\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'A.W.\\', \\'surname\\': \"O\\'Neil\", \\'uri\\': \\'https://orcid.org/0000-0003-3591-1034\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.794011116027832}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2021 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/398dd41e-3c08-47f5-811f-da990007643f\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'C.S.\\', \\'surname\\': \\'Rowland\\', \\'uri\\': \\'https://orcid.org/0000-0002-0459-506X\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.794011116027832}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2021 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/398dd41e-3c08-47f5-811f-da990007643f\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'C.G.\\', \\'surname\\': \\'Marston\\', \\'uri\\': \\'https://orcid.org/0000-0002-2070-2187\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.794011116027832}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2023 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/50b344eb-8343-423b-8b2f-0e9800e34bbd\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'DESCRIPTION_OF\\', \\'connected_node\\': {\\'content\\': \\'This is a vector data set representing the land surface of Great Britain, classified into 21 UKCEH land cover classes, based upon Biodiversity Action Plan broad habitats. This vector Land Parcel dataset is the result of intersecting the 10m raster classified pixel datasets with the UKCEH Land Parcel Spatial Framework to generate summary land parcel attributes for each land cover parcel. A full description of this and all UKCEH LCM2023 products are available from the LCM2023 product documentation.\\', \\'doc_id\\': \\'cdb72afb746b29e46960e530f92abb9bec789522969e3c440e7e34850d99ddaa\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.7924184799194336}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2023 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/50b344eb-8343-423b-8b2f-0e9800e34bbd\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'CONTRIBUTED_TO\\', \\'connected_node\\': {\\'name\\': \\'NERC EDS Environmental Information Data Centre\\', \\'uri\\': \\'https://ror.org/04xw4m193\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Organisation\\'], \\'score\\': 0.7924184799194336}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2023 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/50b344eb-8343-423b-8b2f-0e9800e34bbd\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'CONTRIBUTED_TO\\', \\'connected_node\\': {\\'name\\': \\'UK Centre for Ecology & Hydrology\\', \\'uri\\': \\'https://ror.org/00pggkr55\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Organisation\\'], \\'score\\': 0.7924184799194336}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2023 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/50b344eb-8343-423b-8b2f-0e9800e34bbd\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'LINEAGE_OF\\', \\'connected_node\\': {\\'content\\': \"UKCEH\\'s automated land cover algorithms classify 10 m pixels across the whole of UK. Training data were automatically selected from stable land covers over the interval of 2020 to 2022. A Random Forest classifier used these to classify four composite images representing per season median surface reflectance. Seasonal images were integrated with context layers (e.g., height, aspect, slope, coastal proximity, urban proximity and so forth) to reduce confusion among classes with similar spectra.  \\\\nLand cover was validated by organising the 10 m pixel classification into a land parcel framework (the LCM2023 classified land parcels product). The classified land parcels were compared to known land cover producing a confusion matrix to determine overall and per class accuracy. Details are available from the product documentation.\\\\nThe 25 m rasterised land parcels product is created by pixelating the corresponding land parcel product.\\\\n\", \\'doc_id\\': \\'53fb4f3d2de497a016f486c68f82340cdb003cd6439367e1e02237e0bb3e1a30\\'}, \\'connected_labels\\': [\\'embedded\\', \\'TextChunk\\'], \\'score\\': 0.7924184799194336}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2023 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/50b344eb-8343-423b-8b2f-0e9800e34bbd\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'C.S.\\', \\'surname\\': \\'Rowland\\', \\'uri\\': \\'https://orcid.org/0000-0002-0459-506X\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.7924184799194336}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2023 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/50b344eb-8343-423b-8b2f-0e9800e34bbd\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'A.W.\\', \\'surname\\': \"O\\'Neil\", \\'uri\\': \\'https://orcid.org/0000-0003-3591-1034\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.7924184799194336}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2023 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/50b344eb-8343-423b-8b2f-0e9800e34bbd\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'C.G.\\', \\'surname\\': \\'Marston\\', \\'uri\\': \\'https://orcid.org/0000-0002-2070-2187\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.7924184799194336}, {\\'start_node\\': {\\'title\\': \\'Land Cover Map 2023 (land parcels, GB)\\', \\'uri\\': \\'https://doi.org/10.5285/50b344eb-8343-423b-8b2f-0e9800e34bbd\\'}, \\'start_labels\\': [\\'embedded\\', \\'Dataset\\'], \\'relationship_type\\': \\'AUTHORED_BY\\', \\'connected_node\\': {\\'forename\\': \\'R.D.\\', \\'surname\\': \\'Morton\\', \\'uri\\': \\'https://orcid.org/0000-0003-3947-6463\\'}, \\'connected_labels\\': [\\'embedded\\', \\'Person\\'], \\'score\\': 0.7924184799194336}]\\n```\\n\\n# User Query\\nThe query is: What are some datasets available in the EIDC?', documents=[], meta={})]}}"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from haystack_integrations.components.embedders.ollama import OllamaTextEmbedder\n",
    "from serka.graph.readers import Neo4jGraphReader\n",
    "from haystack.components.builders import PromptBuilder\n",
    "from haystack_integrations.components.generators.ollama.generator import OllamaGenerator\n",
    "from haystack.components.builders.answer_builder import AnswerBuilder\n",
    "\n",
    "query = \"What are some datasets available in the EIDC?\"\n",
    "\n",
    "p = Pipeline()\n",
    "\n",
    "p.add_component(\"embedder\", OllamaTextEmbedder())\n",
    "p.add_component(\n",
    "\t\"reader\", Neo4jGraphReader(username=NEO4J_USERNAME, password=NEO4J_PASSWORD)\n",
    ")\n",
    "p.add_component(\"prompt_builder\", PromptBuilder(GRAPH_PROMPT))\n",
    "p.add_component(\n",
    "\t\"llm\",\n",
    "\tOllamaGenerator(\n",
    "\t\tmodel=\"llama3.1\",\n",
    "\t\tgeneration_kwargs={\"num_ctx\": 16384, \"temperature\": 0.0},\n",
    "\t),\n",
    ")\n",
    "p.add_component(\"answer_builder\", AnswerBuilder())\n",
    "\n",
    "p.connect(\"embedder\", \"reader\")\n",
    "p.connect(\"reader\", \"prompt_builder.nodes\")\n",
    "p.connect(\"prompt_builder\", \"llm\")\n",
    "p.connect(\"llm.replies\", \"answer_builder.replies\")\n",
    "p.connect(\"prompt_builder.prompt\", \"answer_builder.query\")\n",
    "\n",
    "p.run({\"embedder\": {\"text\": query}, \"prompt_builder\": {\"query\": query}})"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
